---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
source: html/d4e6a0ad-06fa-cc59-d384-eaac74111ad7.htm
---
# RebarShapeConstraintFixedSegmentDir Properties

The direction of the RebarShapeSegment in UV-space.